app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(params[:school_class])
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-03-19 07:08:07.287810"], ["updated_at", "2019-03-19 07:08:07.287810"]]